Revit 2024 API
BuiltInFailures.GeometryFailures.FailedUpdateCurveChain Property
 Failed to update curve chain.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FailedUpdateCurveChain { get; }
Visual Basic
Public Shared ReadOnly Property FailedUpdateCurveChain As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FailedUpdateCurveChain {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace